import os
from openai import OpenAI
from pathlib import Path

client = OpenAI(
    api_key="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"
)

all_words = ['些', '吧', '先生', '出租车', '送报员', '送奶员', '公斤', '听说', '服务员', '得', '妻子', '宾馆', '一直', '往', '着急', '复习', '经理', '怎么办', '饮料', '热情', '认真', '客人', '感冒', '锻炼', '音乐会', '公园', '同事', '差', '刻', '层', '一会儿', '马上', '几乎', '个子', '体育', '主要', '环境', '车站', '会议', '结束', '空调', '一双', '笔记本电脑', '电子邮件', '把', '行李箱', '护照', '司机', '终于', '一般', '生活', '累坏', '打扫', '洗澡', '节目', '刮风', '叔叔', '留学', '水平', '提高', '练习', '完成', '发', '网上', '极', '节日', '举行', '街道', '歌舞', '文化', '长', '米', '检查', '请假', '长跑', '必须', '根据', '情况', '向', '同意', '特点', '地', '洗', '位', '西服', '一路上', '鸟叫', '被', '难过', '信用卡', '关心', '只有才', '解决', '试试看', '真正', '多么', '法律', '俩', '踢进个球', '熟悉', '共同', '适合', '幸福', '祝你们幸福', '挺得', '浪漫', '新鲜感', '接受', '羡慕', '即使', '加班', '感动', '说到', '互相', '吸引', '幽默', '红过脸', '适应', '交', '逛街', '短信', '发短信', '正好', '聚会', '联系', '专门', '日子', '校园', '尽管', '友谊', '丰富', '无聊', '却', '周围', '交流', '理解', '而', '困难', '面试', '信心', '能力', '招聘', '招聘会', '提供', '负责', '应聘', '笔试', '材料', '符合', '通知', '当', '专业', '另外', '咱们', '借', '顺利', '首先', '正式', '面试者', '留', '其次', '诚实', '判断', '顾客', '准时', '与', '约会', '提', '别提了', '份', '急着', '调查', '按', '计划', '提前', '提醒', '手忙脚乱', '积累', '一切', '按照', '感谢', '消息', '按时', '奖金', '工资', '责任心', '甚至', '开头', '家具', '打折', '价格', '质量', '流行', '台', '光', '实在', '制冷', '效果', '现金', '邀请', '艺术', '优点', '实际上', '再说', '实际', '实际', '标准', '年龄', '购物', '网上购物', '尤其', '喜爱', '任何', '卖家', '寄', '做客', '果汁', '售货员', '打扰', '竟然', '西红柿', '尝', '方面', '值得', '活动', '内', '支持', '满', '小说', '办', '会员卡', '所有', '获得', '一般来说下', '例如', '举办', '各种各样', '降低', '商场', '气候', '估计', '出现', '来不及', '眼睛跳', '大夫', '远处', '植物', '静坐', '很可能', '指', '说明', '数字', '要是', '既又', '那样', '夫妻', '掉', '巧克力', '女性', '使', '愉快', '景色', '回忆', '成为', '师傅', '大使馆', '堵车', '距离', '可不是', '生命', '态度', '因此', '科学', '证明', '往往', '积极', '得', '坚持', '主意', '得', '国际', '大奖', '通过', '篇', '作家', '当时', '正确', '理想', '勇敢', '失败', '注意力', '过程', '总结', '取得', '经历', '许多', '区别', '暂时', '总', '风雨', '面对', '礼拜天', '空儿', '上有老,下有小', '以外', '脸色', '优秀', '硕士', '翻译', '确实', '兴奋', '建议', '职业', '关键', '将来', '发展', '困', '经济', '条件', '富', '并', '由于', '橡皮', '高低', '流利', '语法', '准确', '词语', '连', '阅读', '来得及', '只好', '填空', '否则', '杂志', '著名', '页', '增加', '减轻', '有效', '内容', '然而', '相同', '顺序', '有限', '养成', '同时', '精彩', '规定', '死', '可惜', '也许', '并且', '作用', '无法', '勺', '节', '欢迎', '详细', '哪里', '对于', '教育', '再也', '使用', '语言', '直接', '引起', '友好', '节约', '力气', '相反', '任务', '意见', '仔细', '达到', '京剧', '演员', '观众', '深厚', '演出', '来自', '一遍', '偶尔', '吃惊', '基础', '传统', '春游', '有趣', '由', '讨论', '正常', '大约', '餐厅', '互联网', '进行', '错误', '随着', '当作', '解渴', '十分', '普遍', '部分', '稍微', '省', '出差', '行', '污染', '卫生间', '扔', '以', '速度', '既然', '停电', '得意', '环保', '暖', '塑料袋', '于是', '拒绝', '数量', '乘坐', '垃圾桶', '棒', '寒假', '批评', '管理', '护士', '表扬', '千万', '怀疑', '敲', '整理', '合适', '而', '儿童', '懒', '骄傲', '读', '博士', '签证', '邀请信', '证明', '填写', '表格', '传真', '参观', '激动', '小伙子', '记者', '大小', '恐怕', '放假', '失望', '郊区', '呀', '外地', '导游', '可', '挂在嘴边', '同情', '推', '预习', '重点', '马虎', '自信', '重视', '尊重', '拿来说', '读博士', '成绩证明', '凉快', '热闹', '广播', '倒', '干', '难受', '趟', '放暑假', '入口', '处', '活泼', '社会', '竞争', '高大', '低矮', '暖和', '水分', '海洋', '公里', '仍然', '排列', '一个个', '降落', '作者', '是否', '交通', '技术', '日记', '密码', '允许', '座', '接着', '警察', '矿泉水', '除此以外', '付款', '举', '举一个例子', '迷路', '地点', '世纪', '邮局', '信息', '现代', '出生', '性别', '打印', '复印', '理发', '零钱', '舞蹈', '国籍', '胳膊', '转', '房东', '战线', '羽毛球', '场', '运动员', '发球', '禁止', '总的来说', '在于', '加油站', '航班', '推迟', '高速公路', '登机牌', '首都', '怪', '烤鸭', '祝贺', '合格', '民族', '小数民族', '钥匙', '究竟', '开着', '棵', '对话', '出发', '小吃', '说起']

for chinese_word in all_words:
    system_command = f"You are a helpful Chinese language tutor, skilled in explaining new vocabulary in an easy to understand way for users who already know only a few elementary Chinese words. You will be given a Chinese word, and you will need to explain its meaning."
    user_command = f"Create an easy to understand chinese sentence for this word that will let me easily infer the meaning of this word: “{chinese_word}”, then explain the meaning using very simple chinese words. Use this format: 这个词是“{chinese_word}”。“{chinese_word}”的意思是。。。比如，。。。Do not use any English words."

    completion = client.chat.completions.create(
        model="gpt-4-turbo-preview",
        messages=[
            {"role": "system", "content": system_command},
            {"role": "user", "content": user_command}
        ]
    )
    print(f"Word complete: {chinese_word}") # print(completion.choices[0].message)

    speech_file_path = Path(__file__).parent / "speech_files" / f"{chinese_word}.mp3"
    response = client.audio.speech.create(
    model="tts-1",
    voice="echo",
    input=completion.choices[0].message.content
    )
    response.stream_to_file(speech_file_path)